Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: Maximum rows to plot
sv: Maximalt antal rader att visa

source: The total time spent in acquiring row locks, in milliseconds.
sv: Total tid spenderad på att skaffa radlås, i millisekunder.

source: URL for reCAPTCHA v2 API
sv: URL för reCAPTCHA v2-API

source: Maintenance operations on multiple tables are disabled.
sv: Underhållsåtgärder på flera tabeller är inaktiverade.

source: Table %s has been emptied.
sv: Tabellen %s har tömts.

source: Login cookie store
sv: Lagringsplats för inloggnings-cookie

source: … revoke all active privileges from the old one and delete it afterwards.
sv: … upphäv alla aktiva privilegier från den gamla och ta bort den efteråt.

source: A bit-field type (M), storing M of bits per value (default is 1, maximum is 64)
sv: En bit-fälttyp (M), lagrar M bitar per värde default är 1, maximalt är 64)

source: Aborted
sv: Avbrutna

source: Users having access to "%s"
sv: Användare som har tillgång till "%s"

source: You may need to increase {key_buffer_size}.
sv: Du kan behöva öka {key_buffer_size}.

source: Default value for foreign key checks checkbox for some queries.
sv: Standardvärdet för kryssrutan "Aktivera kontroller av främmande nycklar", för vissa sökningar.

source: Grid editing: trigger action
sv: Rutnäts-redigering: utlösningsåtgärd

source: Leave blank for no central columns support, suggested: [kbd]pma__central_columns[/kbd].
sv: Lämn tom för inget huvudkolumnstöd, förslag: [kbd] pma__central_columns [/kbd].

source: Please enter only digits
sv: Ange endast siffror

source: Double click
sv: Dubbelklicka

source: (singly)
sv: (var för sig)

source: The current ratio of free query cache memory to total query cache size is %s%%. It should be above 80%%
sv: Det nuvarande förhållandet mellan ledigt frågecacheminne den totala fråge cache-storlek är %s%%. Det bör vara över 80%%

source: Submit query
sv: Skicka fråga

source: You must provide a routine definition.
sv: Du måste ange en rutindefinition.

source: case-insensitive
sv: Skiftlägesokänslig

source: Create version
sv: Skapa version

source: Move repeating groups
sv: Flytta upprepande grupper

source: The first line of the file contains the table column names <i>(if this is unchecked, the first line will become part of the data)</i>
sv: Den första raden i filen innehåller tabellens kolumnnamn <i>(om detta inte är markerat, kommer den första raden bli en del av uppgifterna)</i>

source: Enable gzip compression for import and export operations.
sv: Aktivera gzip-komprimering för import- och exportoperationer.

source: Column-specific privileges
sv: Kolumnspecifika privilegier

source: No routine with name %1$s found in database %2$s.
sv: Ingen rutin med namnet %1$s hittades i databasen %2$s.

source: View only
sv: Visa endast

source: Linting is disabled for this query because it exceeds the maximum length.
sv: Sökningen överstiger maximal längd, tillägg avstängda.

source: Lines terminated with:
sv: Rader avslutas med:

source: Pages containing data
sv: Sidor innehållande data

source: Yes
sv: Ja

source: Use database search
sv: Använd databassökning

source: Server is configured as replica in a replication process. Would you like to:
sv: Servern är konfigurerad som replik i en replikeringsprocess. Vill du:

source: Hide
sv: Dölj

source: Open
sv: Öppen

source: File may be compressed (%s) or uncompressed.
sv: Filen kan vara komprimerad (%s) eller okomprimerad.

source: The number of currently open connections.
sv: Antalet öppna förbindelser.

source: Opened table rate: %s, this value should be less than 10 per hour
sv: Andel öppna tabeller: %s, detta värde bör vara mindre än 10 per timme

source: Chart
sv: Diagram

source: Hide/Show tables with no relationship
sv: Dölj/visa tabeller utan relationer

source: Add DROP VIEW
sv: Lägg till DROP VIEW

source: Data home directory
sv: Hemkatalog för data

source: A timestamp, range is 1970-01-01 00:00:01 UTC to 2038-01-19 03:14:07 UTC on 32-bit platforms (MariaDB 11.3 and earlier), and up to 2106-02-07 06:28:15 UTC on 64-bit platforms (MariaDB 11.5 and later), stored as the number of seconds since the epoch (1970-01-01 00:00:00 UTC)
sv: En tidsstämpel; intervallet är 1970-01-01 00:00:01 UTC till 2038-01-19 03:14:07 UTC på 32-bitarsplattformar (MariaDB 11.3 och tidigare), och upp till 2106-02-07 06:28:15 UTC på 64-bitarsplattformar (MariaDB 11.5 och senare), lagrad som antal sekunder sedan epoken (1970-01-01 00:00:00 UTC)

source: Packed
sv: Packad

source: Toggle navigation
sv: Visa/dölj navigering

source: Enter each value in a separate field.
sv: Mata in varje värde i separat fält.

source: No such column
sv: Ingen sådan kolumn

source: Pagination of user accounts
sv: Sidindelning av användarkonton

source: Advanced options
sv: Avancerade alternativ

source: Deprecated!
sv: Föråldrad!

source: Upload directory
sv: Uppladdningskatalog

source: Show query box
sv: Visa frågerutan

source: Page titles
sv: Sidtitlar

source: With selected:
sv: Med markerade:

source: Not a valid port number!
sv: Inte ett giltigt portnummer!

source: Screenshot of the %s theme.
sv: Skärmbild av temat %s.

source: Table
sv: Tabell

source: Unknown error
sv: Okänt fel

source: Check privileges
sv: Kontrollera privilegier

source: Advisor system
sv: Handledningssystem

source: MariaDB Documentation
sv: MariaDB-dokumentation

source: Default transformations for PreApPend
sv: Standardomvandlingar för PreApPend

source: Requires that a valid X509 certificate issued by this CA be presented.
sv: Kräver att ett giltigt X509-intyg från denna Certifikatutfärdare presenteras.

source: Return length/values
sv: Returnera längd/värden

source: Buffer Pool Usage
sv: Buffertanvändning

source: Not a positive number!
sv: Inte ett positivt tal!

source: Inside column:
sv: Inuti kolumnen:

source: Are you sure you wish to change the collation and convert the data?
sv: Är du säker du vill ändra sorteringen och konvertera data?

source: The profile has been updated.
sv: Profilen har uppdaterats.

source: You do not have InnoDB enabled.
sv: Du har inte aktiverat InnoDB.

source: Add to Favorites
sv: Lägg till i favoriter

source: Database %1$s has been renamed to %2$s.
sv: Databasen %1$s har bytt namn till %2$s.

source: phpMyAdmin homepage
sv: phpMyAdmin:s hemsida

source: User groups
sv: Användargrupper

source: Do you have a group of two or more columns that are closely related and are all repeating the same attribute? For example, a table that holds data on books might have columns such as book_id, author1, author2, author3 and so on which form a repeating group. In this case a new table (book_id, author) should be created.
sv: Har du en grupp av två eller flera kolumner som är närbesläktade och alla upprepar samma attribut? Till exempel kan en tabell som innehåller data om böcker ha kolumner som book_id, author1, Författare2, author3 och så vidare som bildar en upprepande grupp. I detta fall skapas en ny tabell (book_id, författare).

source: Cannot copy database to the same name. Change the name and try again.
sv: Kan inte kopiera databasen till samma namn. Byt namn och försök igen.

source: Index scans average: %s, this value should be less than 1 per hour
sv: Index sökningar i genomsnitt: %s detta värde bör vara mindre än 1 per timme

source: Proxy password
sv: Proxylösenord

source: Maximum number of databases displayed in database list.
sv: Maximalt antal databaser som visas i databaslistan.

source: Hide trace
sv: Dölja spår

source: The number of transactions that used the temporary binary log cache.
sv: Antalet transaktioner som använde den temporära binära loggcachen.

source: Error moving the uploaded file, see [doc@faq1-11]FAQ 1.11[/doc].
sv: Fel vid flytt av uppladdad fil, se [doc@faq1-11]FAQ 1.11[/doc].

source: Please see the documentation on how to update your column_info table.
sv: Se dokumentation om hur du uppdaterar tabellen column_info.

source: New template:
sv: Ny mall:

source: value/subQuery is empty
sv: värdet/underfrågan är tom

source: Add prefix to table
sv: Lägg till prefix till tabellen

source: Structure snapshot
sv: Ögonblicksbild på strukturen

source: You must provide a trigger definition.
sv: Du måste ange en triggerdefinition.

source: %1$d row deleted.
sv: %1$d rad borttagen.

source: %1$d rows deleted.
sv: %1$d rader borttagna.

source: Truncate partition
sv: Töm partition

source: A dropdown will be used if fewer items are present.
sv: En listruta kommer användas om färre objekt finns.

source: Enable ZIP compression for import and export operations.
sv: Aktivera ZIP-komprimering för import- och exportoperationer.

source: Execution order
sv: Körningsordningen

source: No newer stable version is available
sv: Ingen nyare stabil version finns tillgänglig

source: at beginning of table
sv: I början av tabellen

source: Too many connections are aborted.
sv: För många anslutningar avbryts.

source: The PHP function password_hash() with default options.
sv: PHP-funktionen password_hash() med standardalternativ.

source: Collation:
sv: Kollationering:

source: phpMyAdmin was unable to kill thread %s. It probably has already been closed.
sv: phpMyAdmin kunde inte döda tråd %s. Troligtvis har den redan avslutats.

source: Requires that a specific cipher method be used for a connection.
sv: Kräver att en specifik metod att användas för en anslutning.

source: Flush the table (FLUSH)
sv: Rensa tabellen (flush)

source: Skipping errors might lead into unsynchronized primary and replica!
sv: Att hoppa över fel kan medföra att primärservern och repliken inte är synkroniserade.

source: Failed running test for rule '%s'.
sv: Lyckades inte köra test för regeln '%s'.

source: Allows inserting and replacing data.
sv: Tillåter infogning och ersättning av data.

source: Add primary key
sv: Lägg till primär nyckel

source: You have revoked the privileges for %s.
sv: Du har upphävt privilegierna för %s.

source: MySQL Documentation
sv: MySQL-dokumentation

source: Structure for view %s exported as a table
sv: Struktur för vy %s exporterad som en tabell

source: Edit trigger
sv: Redigera trigger

source: Column:
sv: Kolumn:

source: Displays a clickable thumbnail. The options are the maximum width and height in pixels. The original aspect ratio is preserved.
sv: Visar en klickbar tumnagelbild. Parametrarna är maximal bredd och höjd i pixlar. Bildens ursprungliga proportioner bibehålls.

source: It appears your database uses views;
sv: Det verkar som om databasen använder följande vyer;

source: Please select a page to continue
sv: Välj en sida för att fortsätta

source: A BLOB column with a maximum length of 16,777,215 (2^24 - 1) bytes, stored with a three-byte prefix indicating the length of the value
sv: En BLOB-kolumn med en maximal längd av 16.777.215 (2^24-1) bytes, lagrat med ett tre-bytes prefix vilket anger längden av värdet

source: %B %d, %Y at %I:%M %p
sv: %d %B %Y kl %H:%M

source: Native MySQL authentication
sv: MySQL-autentisering

source: Error while working with template cache: %s
sv: Fel vid arbete med mallcachen: %s

source: Table %s has been moved to %s.
sv: Tabellen %s har flyttats till %s.

source: Current selection does not contain a unique column. Grid edit, checkbox, Edit, Copy and Delete features are not available. %s
sv: Nuvarande markering innehåller ingen unik kolumn. Funktionerna rutnätsredigera, kryssruta, redigera, kopiera och radera är inte tillgängliga. %s

source: Without PHP code
sv: Utan PHP-kod

source: Returns
sv: Returnerar

source: To have more accurate averages it is recommended to let the server run for longer than a day before running this analyzer
sv: För att få mer exakta medelvärden rekommenderas att låta servern köras längre än en dag innan du kör denna analysator

source: Read misses
sv: Läsmissar

source: MyISAM concurrent inserts
sv: MyISAM parallella infogningar

source: Error while loading the search.
sv: Fel då sökningen lästes in.

source: This method requires using an '<em>SSL connection</em>' or an '<em>unencrypted connection that encrypts the password using RSA</em>'; while connecting to the server.
sv: Den här metoden kräver en <em>SSL-anslutning</em> eller en <em>okrypterad anslutning som krypterar lösenordet med RSA</em> vid anslutning till servern.

source: Skip current error
sv: Hoppa över nuvarande fel

source: You should upgrade, to a stable version of MySQL 5.5.
sv: Du bör uppgradera till en stabil version av MySQL 5.5.

source: No columns in the central list. Make sure the Central columns list for database %s has columns that are not present in the current table.
sv: Inga kolumner i huvud listan. Kontrollera att huvudlistan för databasen %s har kolumner som inte finns i den aktuella tabellen.

source: Welcome
sv: Välkommen

source: Your absolute InnoDB log size is %s MiB
sv: Din absoluta InnoDB loggstorlek är %s Mb

source: InnoDB is usually the better choice for table engines.
sv: InnoDB är vanligtvis ett bättre val för tabellmotorer.

source: Caching sha2 authentication
sv: Caching SHA-2-autentisering

source: Replace NULL with:
sv: Ersätt NULL med:

source: Display comments <i>(includes info such as export timestamp, PHP version, and server version)</i>
sv: Visa kommentarer <i>(inkluderar info såsom exporttidsstämpel, PHP-version, och serverversion)</i>

source: Column names in first row
sv: Kolumnnamn på första raden

source: Revoke
sv: Upphäv

source: Total Time
sv: Total tid

source: The name '%s' is a MySQL reserved keyword.
sv: Kolumnnamnet '%s' är ett reserverat nyckelord i MySQL.

source: The names '%s' are MySQL reserved keywords.
sv: Kolumnnamnen '%s' är reserverade nyckelord i MySQL.

source: Configure phpMyAdmin configuration storage to gain access to additional features, see [doc@linked-tables]phpMyAdmin configuration storage[/doc] in documentation.
sv: Ställ in konfigurationslagring för phpMyAdmin för att få tillgång till ytterligare funktionalitet, se [doc@linked-tables]konfigurationslagring för phpMyAdmin[/doc] i dokumentationen.

source: The phpMyAdmin configuration storage has been deactivated. %sFind out why%s.
sv: PhpMyAdmins konfigurationslagring har inaktiverats. %sSe varför%s.

source: Index cache size
sv: Cachestorlek för index

source: Allows deleting historical rows.
sv: Tillåter borttagning av historiska rader.

source: Nowhere
sv: Ingenstans

source: Tracking data definition successfully deleted
sv: Spårningsdata har tagits bort

source: phpMyAdmin Demo Server
sv: Demoserver för phpMyAdmin

source: no branch
sv: ingen gren

source: Show only alert values
sv: Visa endast varningsvärden

source: Target for quick access icon
sv: Mål för snabbåtkomst-ikon

source: No SQL query was set to fetch data.
sv: Ingen SQL-fråga var inställd på att hämta data.

source: A year in four-digit (4, default) or two-digit (2) format, the allowable values are 70 (1970) to 69 (2069) or 1901 to 2155 and 0000
sv: Ett år i fyr-siffrigt (4, default) eller 2-siffrigt (2) format, tillåtna värden är: 70 (1970) till 69 (2069) eller 1901 till 2155 och 0000

source: Tracking
sv: Spårning

source: Saved on: @DATE@
sv: Har sparat på: @DATE@

source: Theme
sv: Tema

source: You do not have the privileges to administrate the users!
sv: Du har inte behörighet att administrera användare!

source: Collation
sv: Kollationering

source: key_buffer_size is 0
sv: key_buffer_size är 0

source: Defined aliases
sv: Definierade alias

source: Percentage of physical writes compared to write requests (calculated value)
sv: Andel fysiska skrivningar jämfört med läsbegäran (beräknat värde)

source: Mo
sv: Må

source: Open the linked page in the main window ([code]main[/code]) or in a new one ([code]new[/code]).
sv: Öppna den länkade sidan i huvudfönstret ([code]main[/code]) eller i ett nytt ([code]new[/code]).

source: Export related metadata from phpMyAdmin configuration storage
sv: Exportera relaterade metadata från sparade inställningar i phpMyAdmin

source: CHAR textarea columns
sv: Kolumner för CHAR textfält

source: The number of pending log file fsyncs.
sv: Antalet väntande fsync() av loggfil.

source: Groups:
sv: Grupper:

source: Note: MySQL privilege names are expressed in English.
sv: Obs: privilegienamn i MySQL uttrycks på engelska.

source: Sum
sv: Summa

source: Number of columns
sv: Antal kolumner

source: Warning: a form on this page has more than %d fields. On submission, some of the fields might be ignored, due to PHP's max_input_vars configuration.
sv: Varning: ett formulär på den här sidan har mer än %d fält. Då det skickas kan några av fälten ignoreras på grund av max_input_vars-inställningen för PHP.

source: {tmp_table_size} and {max_heap_table_size} are not the same.
sv: {tmp_table_size} och {max_heap_table_size} är inte samma.

source: Total (since startup) number of times the replication replica SQL thread has retried transactions.
sv: Totalt antal gånger (sedan start) som SQL-tråden för replikeringsrepliken har försökt utföra transaktioner igen.

source: Database name template
sv: Mall för databasnamn

source: User name:
sv: Användarnamn:

source: Delete relationship
sv: Ta bort relation

source: Rename view to
sv: Ändra namn till

source: Sub partitioned by:
sv: Underpartitionerade av:

source: Storage Engine
sv: Lagringsmotor

source: Do you really want to revoke the selected user(s) ?
sv: Vill du verkligen radera markerade användare?

source: Commonly monitored
sv: Vanligtvis övervakade

source: Minimum number of items to display the filter box
sv: Minsta antal objekt för att visa filterboxen

source: None
sv: Inget

source: String that separates databases into different tree levels.
sv: Sträng som separerar databaser i olika trädnivåer.

source: Unknown
sv: Okänd

source: Select columns (at least one):
sv: Markera kolumner (minst en):

source: Highlight row pointed by the mouse cursor.
sv: Markera raden som indikeras av muspekaren.

source: Whether to show procedures under database in the navigation tree
sv: Möjliggör visning av processer kopplade till databasen i navigeringsträdet

source: Go to table: %s
sv: Gå till tabell: %s

source: Default transformations for TextLink
sv: Standardomvandlingar för TextLink

source: the exact phrase as whole field
sv: den exakta frasen som helt fält

source: Referenced by %s.
sv: Refereras av %s.

source: Continue
sv: Fortsätt

source: Export templates:
sv: Exportera mallar:

source: The grow size of the row pointer (.xtr) files.
sv: Storleken med vilken filer för radpekare (.xtr) växer.

source: Some error occurred while getting SQL debug info.
sv: Vissa fel uppstod när SQL inhämtade felinformation.

source: Aggregate
sv: Aggregera

source: The file is being processed, please be patient.
sv: Filen bearbetas, vänligen vänta.

source: Creating a foreign key over a non-indexed column would automatically create an index on it. Alternatively, you can define an index below, before creating the foreign key.
sv: Att skapa en främmande nyckel för en oindexerad kolumn skapar automatiskt ett index för den. Alternativt kan du definiera ett index nedan innan du skapar den främmande nyckeln.

source: Allows user to give to other users or remove from other users privileges that user possess on this routine.
sv: Tillåter att användaren ger andra användare eller tar bort från andra användare de behörigheter som användaren har för denna rutin.

source: Error in processing request: No event with name %1$s found in database %2$s.
sv: Fel vid bearbetning av begäran: Ingen händelse med namnet %1$s hittades i databasen %2$s.

source: EiB
sv: EB

source: Relational display
sv: Relations-visning

source: The username for authenticating with the proxy. By default, no authentication is performed. If a username is supplied, Basic Authentication will be performed. No other types of authentication are currently supported.
sv: Användarnamnet för autentisering med proxy. Standard är ingen autentisering. Om ett användarnamn anges kommer grundläggande autentisering ske. Inga andra typer av autentisering stöds för närvarande.

source: How many rows can be inserted at one time.
sv: Hur många rader som kan infogas på en gång.

source: Defines whether the query box should stay on-screen after its submission.
sv: Anger om frågerutan ska stanna på skärmen efter att den skickats.

source: Export time in UTC
sv: Exportera tid i UTC

source: No partial dependencies found!
sv: Inga partiella beroenden hittade!

source: Except
sv: Förutom

source: Title of browser window when nothing is selected.
sv: Titel på webbläsarfönstret när ingenting är markerat.

source: (See below for the actual view)
sv: (Se nedan för den faktiska vyn)

source: Show trace
sv: Visa spår

source: The number of waits we had because log buffer was too small and we had to wait for it to be flushed before continuing.
sv: Antalet väntanden pga loggbufferten var för liten och vi behövde vänta på att den skulle rensas innan kunde fortsätta.

source: … delete the old one from the user tables.
sv: … ta bort den gamla från användartabellerna.

source: Server type:
sv: Servertyp:

source: Rate of table open
sv: Andelen öppna tabeller

source: The number of log write requests.
sv: Antalet förfrågningar att skriva till logg.

source: You can use MySQL wildcard characters (% and _), escape them if you want to use their literal instances, i.e. use [kbd]'my\_db'[/kbd] and not [kbd]'my_db'[/kbd].
sv: Du kan använda MySQL:s jokertecken (% och _), sätt \ före dem om du vill använda deras ordagranna betydelse, dvs använd [kbd] 'my\_db"[/kbd] och inte [kbd]'my_db"[/kbd].

source: Column
sv: Kolumn

source: Let every user access this bookmark
sv: Låt alla användare få tillgång till detta bokmärke

source: Add %d value(s)
sv: Lägg till %d värde(n)

source: Columns enclosed with
sv: Kolumner omges av

source: Your password is too long. To prevent denial-of-service attacks, phpMyAdmin restricts passwords to less than 2000 characters.
sv: Lösenordet är för långt. För att förhindra överbelastningsattacker begränsar phpMyAdmin lösenord till färre än 2 000 tecken.

source: Whether to show row links even in the absence of a unique key.
sv: Möjliggör visning av rad-länkar även vid avsaknad av en unik nyckel.

source: File %s already exists on server, change filename or check overwrite option.
sv: Filen %s finns redan på servern, ändra filnamnet eller kontrollera ersättningsalternativet.

source: Engine
sv: Motor

source: Edit user group: '%s'
sv: Redigera användargrupp: '%s'

source: Confirm disabling two-factor authentication
sv: Bekräfta inaktivering av tvåfaktorsautentisering

source: The cache is currently fragmented by %s%% , with 100%% fragmentation meaning that the query cache is an alternating pattern of free and used blocks. This value should be below 20%%.
sv: Cachen är för närvarande fragmenterad med %s%% , med 100%% fragmentering vilket innebär att frågecachen har ett växlande mönster av lediga och använda block. Detta värde bör vara under 20%%.

source: Deleting tracking data
sv: Tar bort spårningsdata

source: Console
sv: Konsol

source: Sorry, we failed to restore the dropped trigger.
sv: Tyvärr lyckades vi inte återställa den släppta triggern.

source: Username
sv: Användarnamn

source: Allows reloading server settings and flushing the server's caches.
sv: Tillåter omladdning av serverinställningar och rensning av serverns cache.

source: MyISAM key buffer (index cache) % used is low.
sv: Användningen av MyISAM-nyckelbufferten (indexcache) är låg.

source: Suboptimal caching method.
sv: Ej optimal cache-metod.

source: Maximum number of rows to display
sv: Maximalt antal rader att visa

source: Change all tables columns collations
sv: Ändra sorteringsordning för alla tabellkolumner

source: Sort by key:
sv: Sortera efter nyckel:

source: Empty session data
sv: Tom sessionsdata

source: Stop SQL Thread only
sv: Stoppa endast SQL-tråd
